In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Удаление столбцов и строк. Отсутствующие значения.

In [2]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, np.nan]})
df

   A  B    C
0  1  4  7.0
1  2  5  8.0
2  3  6  NaN

Проверка на NaN-ы:

In [3]:
df.isna()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False   True

In [4]:
df.isna().sum()

A    0
B    0
C    1
dtype: int64

Удалять строки и столбцы с пустыми значениями можно с помощию функции `dropna`. Обратите внимание, что применение функции без присваивания создает новый объект, а не меняет *df*.

In [5]:
df.dropna()

   A  B    C
0  1  4  7.0
1  2  5  8.0

Как и у многих других функций библиотек `numpy` и `pandas` есть аргумент `axis`, который отвечает за выбор: просмотр строк или просмотр столбцов:

In [6]:
df.dropna(axis = 0)

   A  B    C
0  1  4  7.0
1  2  5  8.0

In [7]:
df.dropna(axis = 1)

   A  B
0  1  4
1  2  5
2  3  6

Пропущенные значения можно не только удалить, но и заполнить:

In [17]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

Заполнить можно значением:

In [9]:
df.fillna(value=0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

Словарем значений:

In [16]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

Методом заполнения вперед:

In [18]:
df.fillna(method="ffill")

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

Методом заполенения назад:

In [19]:
df.fillna(method="bfill")

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  3.0 NaN  4.0
3  NaN  3.0 NaN  4.0

И, конечно, нужно уметь удалять ненужные столбцы. Для этого есть функция `drop`. Здесь мы уже не обращаем внимание на наличие или отсутствие пустых значений. Параметрами подаются список названий колонок для удаления, и часто указывается `axis=1`, т.к. по умолчанию считается axis=0, в этом случае поиск будет по индексам строк.

In [20]:
df.drop(["C"], axis = 1)

     A    B    D
0  NaN  2.0  0.0
1  3.0  4.0  1.0
2  NaN  NaN  NaN
3  NaN  3.0  4.0

In [21]:
df.fillna(method="bfill").drop(["A", "C"], axis = 1)

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Функция `drop` также не изменяет исходный объект, а создает новый. Для изменения исходного объекта нужно присвоить ему этот результат:

In [22]:
df = df.fillna(method="bfill").drop(["A", "C"], axis = 1)

In [23]:
df

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Еще пара способов:

In [24]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [25]:
df.mean()

A    3.000000
B    3.000000
C         NaN
D    1.666667
dtype: float64

In [26]:
df.fillna(df.mean())

     A    B   C         D
0  3.0  2.0 NaN  0.000000
1  3.0  4.0 NaN  1.000000
2  3.0  3.0 NaN  1.666667
3  3.0  3.0 NaN  4.000000

In [27]:
df.fillna(df.min())

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  2.0 NaN  0.0
3  3.0  3.0 NaN  4.0

In [39]:
df.fillna(df.min()).fillna(df.max().min())

     A    B    C    D
0  3.0  2.0  3.0  0.0
1  3.0  4.0  3.0  1.0
2  3.0  2.0  3.0  0.0
3  3.0  3.0  3.0  4.0

**Упражнение 1.** Объясните, как работает ячейка выше.

In [ ]:
1) ищутся минимумы и максимумы по столбцам
2) Nan заполняются минимумами по столбцам, в столбце С остаётся Nan, т. к. там не было других значений
3) ищется минимум в столбце максимумов, им заполняются оставшиеся Nan в столбце С

**Упражнение 2.** Дан датафрейм в ячейке ниже, состоящий из 4 единиц на диагонали и nan-ов. Заполнить его так, чтобы в нем было 8 единиц и 8 двоек. Использовать только `fillna`.

In [97]:
df = pd.DataFrame([[1, np.nan, np.nan, np.nan],
                   [np.nan, 1, np.nan, np.nan],
                   [np.nan, np.nan, 1, np.nan],
                   [np.nan, np.nan, np.nan, 1]],
                columns=list("ABCD"))
df

     A    B    C    D
0  1.0  NaN  NaN  NaN
1  NaN  1.0  NaN  NaN
2  NaN  NaN  1.0  NaN
3  NaN  NaN  NaN  1.0

In [79]:
#df[['A']]=df[['A']].fillna(value = 1)

In [82]:
df1 = df.fillna(limit = 1, value = 1).fillna(value = 2)
df1

     A    B    C    D
0  1.0  1.0  1.0  1.0
1  1.0  1.0  2.0  2.0
2  2.0  2.0  1.0  2.0
3  2.0  2.0  2.0  1.0

**Упражнение 3.** Из полученного датафрейма удалить столбец (или столбцы) с минимальной суммой значений.

In [ ]:
#столбцы получились одинаковые, создала новый DataFrame

In [98]:
values = {"A":1, "B":2,"C":3,"D":4}
df1 = df.fillna(value = values)

In [99]:
m = df1.sum().min() #это мой первый код, сделала как умею
for i in df1.columns:
    print(df1[[i]].sum())
    if int(df1[[i]].sum()) == m:
        df1 = df1.drop ([i], axis = 1)
df1

A    4.0
dtype: float64
B    7.0
dtype: float64
C    10.0
dtype: float64
D    13.0
dtype: float64

     B    C    D
0  2.0  3.0  4.0
1  1.0  3.0  4.0
2  2.0  1.0  4.0
3  2.0  3.0  1.0

In [100]:
values = {"A":1, "B":2,"C":3,"D":4}
df1 = df.fillna(value = values)

In [104]:
df1.drop(df1.columns[df1.sum().argmin()], axis = 1) #это нормальный код

     B    C    D
0  2.0  3.0  4.0
1  1.0  3.0  4.0
2  2.0  1.0  4.0
3  2.0  3.0  1.0

## Еще работа с данными. Пассажиры Титаника.

In [106]:
df = pd.read_csv(r'train.csv') #поменять путь на актуальный для вас

In [107]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [108]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [109]:
df.shape

(891, 12)

**Упражнение 4.** Найдите средний возраст пассажиров

In [113]:
df["Age"].mean()

29.69911764705882

**Упражнение 5.** Выведите имя самого молодого пассажира.

In [117]:
df.loc[df["Age"].argmin()]["Name"]

'Thomas, Master. Assad Alexander'

**Упражнение 6.** Посчитайте доли пассажиров по классам обслуживания (Pclass)

In [180]:
s = df.shape[0]
for i in df["Pclass"].unique():
    print(i, df[df["Pclass"] == i].shape[0]/s)

3 0.5510662177328844
1 0.24242424242424243
2 0.20650953984287318

**Упражнение 7.** Найдите средние возраста пассажиров по классам обслуживания.

In [144]:
df.groupby("Pclass").mean()["Age"]

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

**Упражнение 8.** Удалите столбец с наибольшим числом пропусков.

In [186]:
df.drop(df.columns[df.isna().sum().argmax()], axis = 1)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,female,35.0,1,0,113803,53.1000,S
4,0,3,male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,S
887,1,1,female,19.0,0,0,112053,30.0000,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,S
889,1,1,male,26.0,0,0,111369,30.0000,C
890,0,3,male,32.0,0,0,370376,7.7500,Q

**Упражнение 9.** Удалите столбцы с наибольшим числом уникальных значений.

In [179]:
m = 0
for i in df.columns:
    c = len(df[i].unique())
    if c>m:
        m=c
for i in df.columns:
    if len(df[i].unique()) == m:
        df = df.drop(i, axis = 1)
df

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

**Упражнение 10.** Найдите доли выживших среди мужчин, среди женщин и среди всех пассажиров.

In [163]:
sm = df[df["Sex"] == "male"].shape[0]
print("male", df[(df["Sex"] == "male")&(df["Survived"] == 1)].shape[0]/sm)
sf = df[df["Sex"] == "male"].shape[0]
print("female", df[(df["Sex"] == "female")&(df["Survived"] == 1)].shape[0]/sf)
s = df.shape[0]
print("all", df[df["Survived"] == 1].shape[0]/s)

male 0.18890814558058924
female 0.4038128249566724
all 0.3838383838383838

**Упражнение 11.** Найдите доли выживших по классам обслуживания.

In [162]:
for i in df["Pclass"].unique():
    s = df[df["Pclass"] == i].shape[0]
    print(i, df[(df["Pclass"] == i)&(df["Survived"] == 1)].shape[0]/s)

3 0.24236252545824846
1 0.6296296296296297
2 0.47282608695652173

**Упражнение 12.** Найдите доли выживших среди возрастных категорий 18-, 18-60, 60+.

In [166]:
s1 = df[df["Age"] < 18].shape[0]
print("<18", df[(df["Age"] < 18)&(df["Survived"] == 1)].shape[0]/s1)
s3 = df[(df["Age"] >= 18) & (df["Age"] <= 60)].shape[0]
print("18-60", df[(df["Age"] >= 18)&(df["Survived"] == 1)&(df["Age"] <= 60)].shape[0]/s3)
s2 = df[df["Age"] > 60].shape[0]
print(">60", df[(df["Age"] > 60)&(df["Survived"] == 1)].shape[0]/s2)

<18 0.5398230088495575
18-60 0.38687392055267705
>60 0.22727272727272727

In [ ]:
!pwd